app/Controllers/Post.php

SELECT *
FROM `posts`
 LIMIT 2
SELECT COUNT(*) AS `numrows`
FROM `posts`
---
    public function index()
    {
        // ambil data paginate (2 item per halaman), grup 'posts'
        $posts  = $this->postModel->paginate(2, 'posts');